## Introduction test

#### Our goals today are to be able to: <br/>

- Investigate table data in Pandas
- Manipulate Pandas DataFrames

In [1]:
list_of_squares = []
for x in range(1, 11):
    list_of_squares.append(x**2)
print(list_of_squares)

[1, 4, 9, 16, 25, 36, 49, 64, 81, 100]

In [5]:
[x**2 for x in range(1, 11) if x % 2 == 1]

[1, 9, 25, 49, 81]

In [4]:
{x: x**2 for x in range(1, 11)}

{1: 1, 2: 4, 3: 9, 4: 16, 5: 25, 6: 36, 7: 49, 8: 64, 9: 81, 10: 100}

### Activation:

![excel2](img/excelpic2.jpg)

Most people have used Microsoft Excel or Google sheets. But what are the limitations of excel?

- [Take a minute to read this article](https://www.bbc.com/news/magazine-22223190)
- make a list of problems excel presents

How is using python different?

Python
- create documentation of processes as you code
- reduces chances for human error
- do "drag and drop"
- repeatable
- transparent

## Pandas

<img src="https://cdn-images-1.medium.com/max/1600/1*9IU5fBzJisilYjRAi-f55Q.png" width=600>  




- The data manipulation capabilities of Pandas are built on top of the numpy library.
- Pandas dataframe object represents a spreadsheet with cell values, column names, and row index labels.

### 1. Importing and reading data with Pandas!

#### Let's use pandas to read some csv files so we can interact with them.

In [6]:
# First, let's check which directory we are in so the files we expect to see are there.
!pwd
!ls -la

/c/Users/Yuki Yaguchi/code/flatiron/hbs-ds-060120/module-1/day-5-pandas-1
total 36
drwxr-xr-x 1 Yuki Yaguchi 197609     0 Jun  5 23:42 .
drwxr-xr-x 1 Yuki Yaguchi 197609     0 Jun  5 23:32 ..
drwxr-xr-x 1 Yuki Yaguchi 197609     0 Jun  5 23:36 .ipynb_checkpoints
drwxr-xr-x 1 Yuki Yaguchi 197609     0 Jun  5 23:32 data
drwxr-xr-x 1 Yuki Yaguchi 197609     0 Jun  5 23:32 img
-rw-r--r-- 1 Yuki Yaguchi 197609 21447 Jun  5 23:42 pandas-1.ipynb

In [7]:
!ls -la data

total 6
drwxr-xr-x 1 Yuki Yaguchi 197609   0 Jun  5 23:32 .
drwxr-xr-x 1 Yuki Yaguchi 197609   0 Jun  5 23:42 ..
-rw-r--r-- 1 Yuki Yaguchi 197609  65 Jun  5 23:32 example1.csv
-rw-r--r-- 1 Yuki Yaguchi 197609 245 Jun  5 23:32 made_up_jobs.csv

In [8]:
import pandas as pd

example_csv = pd.read_csv('data/example1.csv')

In [9]:
example_csv

     Title1    Title2    Title3
0       one       two     three
1  example1  example2  example3

In [10]:
!cat data/example1.csv

Title1,Title2,Title3
one,two,three
example1,example2,example3

In [12]:
type(example_csv)

pandas.core.frame.DataFrame

There is also `read_excel`, `read_html`, and many other pandas `read_` functions.  
http://pandas.pydata.org/pandas-docs/stable/user_guide/io.html

In [14]:
example_csv.describe()

       Title1 Title2 Title3
count       2      2      2
unique      2      2      2
top       one    two  three
freq        1      1      1

In [15]:
example_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Title1  2 non-null      object
 1   Title2  2 non-null      object
 2   Title3  2 non-null      object
dtypes: object(3)
memory usage: 176.0+ bytes

Try loading in the example file in the `data` directory called `made_up_jobs.csv` using pandas.

In [19]:
# read in your csv here!
muj = pd.read_csv('data/made_up_jobs.csv')

# remember that it's nice to be able to look at your data, so let's do that here, too.
muj.head()

   ID           Name                       Job  Years Employed
0   0   Bob Bobberty  Underwater Basket Weaver              13
1   1   Susan Smells             Salad Spinner               5
2   2  Alex Lastname      Productivity Manager               2
3   3        Rudy P.                Being cool              55
4   4        Rudy G.  Being compared to Rudy P              50

In [17]:
muj.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   ID              6 non-null      int64
 1   Name            6 non-null      object
 2   Job             6 non-null      object
 3   Years Employed  6 non-null      int64
dtypes: int64(2), object(2)
memory usage: 320.0+ bytes

In [22]:
import numpy as np
ramdom_df = pd.DataFrame(np.random.random((10000,10)))

In [25]:
ramdom_df

,0,1,2,3,4,5,6,7,8,9
0,0.368470,0.587782,0.204849,0.025064,0.778176,0.946750,0.502665,0.859043,0.570121,0.714402
1,0.356196,0.096810,0.829240,0.551132,0.725028,0.955665,0.246516,0.521832,0.849870,0.833279
2,0.156742,0.821200,0.025011,0.622499,0.646926,0.806643,0.974042,0.397150,0.617783,0.121680
3,0.175196,0.277810,0.144144,0.413783,0.846970,0.821514,0.786544,0.383945,0.528845,0.030033
4,0.923839,0.271281,0.894050,0.824377,0.744600,0.096354,0.138571,0.122238,0.754335,0.942270
...,...,...,...,...,...,...,...,...,...,...
9995,0.333821,0.754005,0.724654,0.771724,0.604739,0.665227,0.713967,0.537633,0.031970,0.061336
9996,0.469964,0.791513,0.562361,0.628810,0.950264,0.561728,0.336229,0.848903,0.084058,0.004392
9997,0.718769,0.408694,0.517007,0.136768,0.256247,0.612228,0.224230,0.210604,0.029450,0.786552
9998,0.390978,0.209241,0.408381,0.780383,0.311261,0.913368,0.173481,0.977062,0.535431,0.456085
9999,0.558621,0.791855,0.765800,0.265893,0.717984,0.830094,0.501146,0.239607,0.575014,0.287659

In [34]:
pd.DataFrame([[1,2,3], [4,5,6]])

   0  1  2
0  1  2  3
1  4  5  6

### 2. Utilizing and identifying Pandas objects

- What is a DataFrame object and what is a Series object? 
- How are they different from Python lists?

These are questions we will cover in this section. To start, let's start with this list of fruits.

In [28]:
fruits = ['Apple', 'Orange', 'Watermelon', 'Lemon', 'Mango']

print(fruits)

['Apple', 'Orange', 'Watermelon', 'Lemon', 'Mango']

In [29]:
[x.lower() for x in fruits]

['apple', 'orange', 'watermelon', 'lemon', 'mango']

In [30]:
fruits

['Apple', 'Orange', 'Watermelon', 'Lemon', 'Mango']

Using our list of fruits, we can create a pandas object called a 'series' which is much like an array or a vector.

In [31]:
fruits_series = pd.Series(fruits)

print(fruits_series)

type(fruits_series)

0         Apple
1        Orange
2    Watermelon
3         Lemon
4         Mango
dtype: object

pandas.core.series.Series

One difference between python **list objects** and pandas **series objects** is the fact that you can define the index manually for a **series objects**.

In [32]:
ind = ['a', 'b', 'c', 'd', 'e']

fruits_series = pd.Series(fruits, index=ind)

print(fruits_series)

a         Apple
b        Orange
c    Watermelon
d         Lemon
e         Mango
dtype: object

With a partner, create your own custom series from a list of lists.

In [33]:
list_of_lists = [['cat'], ['dog'], ['horse'], ['cow'], ['macaw']]

# create custom indices for your series
ind = ['a', 'b', 'c', 'd', 'e']

elements=[x[0].lower() for x in list_of_lists]

# create the series using your list objects
# You can use either a for loop or also pd.Series
list_of_lists_series = pd.Series(elements, index=ind)

# print your series
print(list_of_lists_series)
type(list_of_lists_series)

a      cat
b      dog
c    horse
d      cow
e    macaw
dtype: object

pandas.core.series.Series

We can do a simliar thing with Python dictionaries. This time, however, we will create a DataFrame object from a python dictionary.

In [45]:
# Dictionary with list object in values
student_dict = {
    'name': ['Samantha', 'Alex', 'Dante'],
    'age': ['35', '17', '26'],
    'city': ['Houston', 'Seattle', 'New york']
}

students_df = pd.DataFrame(student_dict)

students_df.head()

       name age      city
0  Samantha  35   Houston
1      Alex  17   Seattle
2     Dante  26  New york

In [46]:
#to find data types of columns
students_df.dtypes

name    object
age     object
city    object
dtype: object

Let's change the data type of ages to int.

In [49]:
#Uncomment line below and observe what happens when trying to convert student's name to int or float
students_df.age = students_df.age.astype(int)

# #How about what happens converting numeric to string
# students_df.name = students_df.name.astype(int)

# students_df.age = students_df.age.astype(str)
# students_df.name = students_df.name.astype(str)

students_df.dtypes

name    object
age      int32
city    object
dtype: object

We can also use a custom index for these items. For example, we might want them to be the individual student ID numbers.

In [53]:
school_ids = ['1111', '1145', '0096']

# Notice here we use pd.DataFrame not pd.Series as we did for a pandas series.
students_df = pd.DataFrame(student_dict, index=school_ids)

students_df.head()

          name age      city
1111  Samantha  35   Houston
1145      Alex  17   Seattle
0096     Dante  26  New york

Using Pandas, we can also rename column names.

In [55]:
students_df.columns

Index(['name', 'age', 'city'], dtype='object')

In [56]:
students_df.columns = ['NAME', 'AGE', 'HOME']
students_df.head()

          NAME AGE      HOME
1111  Samantha  35   Houston
1145      Alex  17   Seattle
0096     Dante  26  New york

Or, we can also change the column names using the rename function.

In [57]:
students_df.rename(columns={"AGE": "YEARS"})

          NAME YEARS      HOME
1111  Samantha    35   Houston
1145      Alex    17   Seattle
0096     Dante    26  New york

In [58]:
# Notice what happens when we print students_df

students_df

          NAME AGE      HOME
1111  Samantha  35   Houston
1145      Alex  17   Seattle
0096     Dante  26  New york

In [59]:
# If you want the file to save over itself, use the option `inplace = True`.
students_df.rename(columns={'AGE': 'YEARS'}, inplace=True)
students_df.head()

          NAME YEARS      HOME
1111  Samantha    35   Houston
1145      Alex    17   Seattle
0096     Dante    26  New york

Similarly, there is a tool to remove rows and columns from your DataFrame

In [60]:
students_df.drop(columns=['YEARS', 'HOME'])

          NAME
1111  Samantha
1145      Alex
0096     Dante

In [61]:
#Notice again what happens if we print students_df 
students_df

          NAME YEARS      HOME
1111  Samantha    35   Houston
1145      Alex    17   Seattle
0096     Dante    26  New york

In [62]:
students_df.drop(columns=['YEARS', 'HOME'], inplace=True)
students_df

          NAME
1111  Samantha
1145      Alex
0096     Dante

If you want the file to save over itself, use the option `inplace = True`.

Every function has options. Let's read more about `drop` [here](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop.html)

### 3. Filtering Data Using Pandas
There are several ways to grab particular data from a DataFrame. 
- Python lists allow for selection of data only through integer location. 
- You can use a single integer or slice notation to make the selection but NOT a list of integers.
- Dictionaries only allow selection with a single label. Slices and lists of labels are not allowed.

In [63]:
l = [1, 2, 3, 4, 5]
l[[0, 3]]

TypeError: list indices must be integers or slices, not list

### DataFrames can be indexed by column name (label) or row name (index) or by position.   
#### The `.loc` method is used for indexing by name.  
#### While `.iloc` is used for indexing by number.

In [64]:
student_dict = {
    'name': ['Samantha', 'Alex', 'Dante'],
    'age': ['35', '17', '26'],
    'city': ['Houston', 'Seattle', 'New york']
}

students_df = pd.DataFrame(student_dict)

In [65]:
students_df.loc[:, 'name']

0    Samantha
1        Alex
2       Dante
Name: name, dtype: object

### Let's take a look at `.iloc`
#### `.iloc` takes slices based on index position.
#### `.iloc` stands for integer location so that should help with remember what it does
#### `.iloc`[row , column]

In [66]:
# returns the first row
students_df.iloc[0]

name    Samantha
age           35
city     Houston
Name: 0, dtype: object

In [67]:
# returns the first column
students_df.iloc[:, 0]

0    Samantha
1        Alex
2       Dante
Name: name, dtype: object

In [68]:
# returns first two rows notice that ILOC performs regular python slicing.
students_df.iloc[0:2]

       name age     city
0  Samantha  35  Houston
1      Alex  17  Seattle

In [69]:
# returns the first two columns
students_df.iloc[:, 0:2]

       name age
0  Samantha  35
1      Alex  17
2     Dante  26

In [70]:
# returns first row and columns 1 and 2
students_df.iloc[0:1, 0:2]

       name age
0  Samantha  35

### How would we use `.iloc` to return the last item in the last row?

In [71]:
# return the last item in the last row using iloc
students_df.iloc[-1]

name       Dante
age           26
city    New york
Name: 2, dtype: object

### How would we use `.iloc` to return the last item in the last column?

In [72]:
# return the last item in the last column using iloc
students_df.iloc[-1, -1]

'New york'

### What if we only want certain columns or rows?

In [73]:
# Don't do students_df.iloc[0, 2]
students_df.iloc[[0, 2]]

       name age      city
0  Samantha  35   Houston
2     Dante  26  New york

In [74]:
students_df.iloc[[0, 2], [0, 2]]

       name      city
0  Samantha   Houston
2     Dante  New york

### Let's take a look at `.loc`
#### Label based method. 
#### Names or labels of the index is used when taking slices.
#### Also supports boolean subsetting.

In [75]:
students_df.set_index('name')

         age      city
name
Samantha  35   Houston
Alex      17   Seattle
Dante     26  New york

In [79]:
students_df.reset_index()

   index      name age      city
0      0  Samantha  35   Houston
1      1      Alex  17   Seattle
2      2     Dante  26  New york

In [80]:
students_df.set_index('name')

         age      city
name
Samantha  35   Houston
Alex      17   Seattle
Dante     26  New york

In [ ]:
# We will use loc to return rows and columns based on labels. Let's look at the students_df DataFrame again.
students_df

In [ ]:
# returns the student information associated with index 0
students_df.loc[0]

In [ ]:
# returns the student information for row index 0 to 2 inclusive.
# note iloc would return normal python slicing not including 2 as demonstrated above.
students_df.loc[0:2]

In [ ]:
# returns the column labeled 'age'
students_df.loc[:, 'age']

In [ ]:
# returns the column labeled 'age' and index values 1 to 2.
# gives us the values of the rows with index from 1 to 2 (inclusive)
# and columns labeled age"
students_df.loc[1:2, 'age']

In [ ]:
# returns the column labeled 'age' and index values 1 to 2.
# gives us the values of the rows with index from 1 to 2 (inclusive)
# and columns labeled age to city (inclusive)"
students_df.loc[1:2, 'age':'city']

In [ ]:
# What should we get?
students_df.loc[1:2, ['name', 'city']]

In [ ]:
# How about?
students_df.loc[[0, 2], ['name', 'city']]

In [ ]:
# if index rearranged
school_ids = ['5', '11', '3']
students_df = pd.DataFrame(student_dict, index=school_ids)

In [ ]:
students_df

In [ ]:
# What should we get now?
students_df.loc[[0, 2], ['name', 'city']]

In [ ]:
# What should we get now?
students_df.loc[['5', '11'], ['name', 'city']]

In [ ]:
students_df.set_index("name", inplace=True)
students_df

In [ ]:
students_df.loc[['Samantha']]

In [ ]:
# Subsetting nonconsecutive rows
students_df.loc[['Samantha', 'Dante']]

In [ ]:
# Samantha to the end
students_df.loc['Samantha':]

In [ ]:
# return the first and last rows using one loc command

### Boolean Subsetting

In [87]:
from statistics import median, mean, mode

mode([19, 18, 21, 16, 15, 17, 20, 18])

18

In [86]:
median([22, 56, 11, 4, -17, 6, 80, -126])

8.5

In [81]:
student_dict = {
    'name': ['Samantha', 'Alex', 'Dante', 'Samantha'],
    'age': ['35', '17', '26', '21'],
    'city': ['Houston', 'Seattle', 'New york', 'Atlanta'],
    'state': ['Texas', 'Washington', 'New York', 'Georgia']
}

students_df = pd.DataFrame(student_dict)

In [82]:
# The statement data[‘name’] == ‘Samantha’] produces a Pandas Series with a True/False value for every row
# in the ‘data’ DataFrame, where there are “True” values for the rows where the name is “Samantha”.
# These type of boolean arrays can be passed directly to the .loc indexer.
students_df.loc[students_df['name'] == 'Samantha']

       name age     city    state
0  Samantha  35  Houston    Texas
3  Samantha  21  Atlanta  Georgia

In [ ]:
# What about if we only want the city and state of the selected students with the name Samantha?
students_df.loc[students_df['name'] == 'Samantha', ['city', 'state']]

In [ ]:
# What amount if we want to select a student of a specific age?
students_df.loc[students_df['age'] == '21']

In [ ]:
# What amount if we want to select a student of a specific age?
students_df.loc[(students_df['age'] == '21') &
                (students_df['city'] == 'Atlanta')]

In [ ]:
# What should be returned?
students_df.loc[(students_df['age'] == '35') &
                (students_df['city'] == 'Atlanta')]